{
    "id": "keto-seasoning_basic_seasoning_blend_001",
    "name": "Basic Seasoning Blend",
    "ingredients": [
      "1/4 cup salt",
      "1 tablespoon pepper",
      "1 tablespoon garlic powder",
      "1 tablespoon onion powder"
    ],
    "utensils": [
      "Measuring cups and spoons",
      "Small mixing bowl",
      "Whisk or fork for mixing",
      "Airtight container for storage"
    ],
    "cookingTime": 0,
    "prepTime": 5,
    "instructions": [
      {
        "time": 3,
        "en": "Measure out all the ingredients into a small mixing bowl.",
        "sk": "Odmerajte všetky prísady do malej misky na miešanie.",
        "ja": "すべての材料を小さなボウルに計量して入れます。",
        "primaryIngredient": "spices"
      },
      {
        "time": 2,
        "en": "Whisk or stir all ingredients together until well combined.",
        "sk": "Vyšľahajte alebo premiešajte všetky prísady, až kým sa dobre nespoja.",
        "ja": "全ての材料がよく混ざるまで泡立て器や箸でかき混ぜます。",
        "primaryIngredient": "mixture"
      }
    ],
    "favorite": false,
    "recipeType": "keto-seasoning",
    "notes": "This Basic Seasoning Blend is a versatile, keto-friendly spice mix that can be used to enhance the flavor of various dishes without adding carbs. It's perfect for seasoning meats, vegetables, eggs, and other keto-friendly foods. The blend of salt, pepper, garlic powder, and onion powder provides a well-rounded flavor profile that complements a wide range of recipes. This seasoning is ideal for those following a ketogenic diet as it contains no added sugars or carbs. For the best results, use fresh, high-quality spices. This seasoning mix can be stored in an airtight container in a cool, dry place for up to 6 months. To use, simply sprinkle over your food before or during cooking. Remember that this blend contains a significant amount of salt, so adjust the quantity used based on your dietary needs and taste preferences. You can also customize this blend by adding other keto-friendly spices like paprika, cayenne pepper, or dried herbs to suit your taste."
  }