{
    "id": "swiss-chicken-rolls",
    "name": "Swiss Chicken Rolls",
    "ingredients": [
      "4 boneless chicken breasts, flattened until very thin",
      "6 ounces Swiss cheese, cut into 4 equal pieces",
      "3 1/4 ounces thin sliced deli-style smoked ham, 8 slices",
      "4 tablespoons butter, divided",
      "1 tablespoon oil",
      "Salt and pepper, to taste",
      "8 ounces baby bella or cremini mushrooms, sliced",
      "1/2 cup dry white wine",
      "1/2 cup chicken broth",
      "4 ounces fresh baby spinach, optional",
      "Chopped fresh parsley, optional"
    ],
    "utensils": [
      "Very large skillet",
      "Cutting board"
    ],
    "cookingTime": 25,
    "prepTime": 20,
    "instructions": [
      {
        "time": 10,
        "en": "Assemble chicken rolls: Place ham slices on work surface, wrap around cheese, place on chicken breast, roll up chicken to enclose filling. Season with salt and pepper.",
        "primaryIngredient": "chicken"
      },
      {
        "time": 10,
        "en": "Heat 2 tablespoons butter and oil in skillet. Brown chicken rolls on all sides over medium-high heat.",
        "primaryIngredient": "chicken"
      },
      {
        "time": 15,
        "en": "Reduce heat to medium-low. Add mushrooms, wine, and broth. Cook chicken rolls 10-15 minutes, turning occasionally, until cheese starts to seep out.",
        "primaryIngredient": "chicken"
      },
      {
        "time": 5,
        "en": "Remove chicken rolls from pan. Add remaining butter to pan juices, adjust seasoning.",
        "primaryIngredient": "butter"
      },
      {
        "time": 5,
        "en": "Slice each chicken roll into about 6 slices on the bias. Arrange on bed of spinach. Pour pan juices and mushrooms over chicken. Sprinkle with parsley if desired.",
        "primaryIngredient": "chicken"
      }
    ],
    "favorite": false,
    "recipeType": "keto-main",
    "notes": "Makes 4 servings. Do not freeze. Chicken rolls can be assembled ahead and refrigerated, but may need longer cooking time if cold. Use very thinly sliced ham to avoid bulkiness.",
    "nutritionalInformation": {
      "amount": "Per Serving",
      "calories": "486",
      "protein": "47g",
      "carbohydrates": "5g",
      "fat": "29g"
    }
  }